---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail.ByView
enum: Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail
source: html/c6900367-d935-4f51-74e9-402504e0baed.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail.ByView

The level detail is taken from the view.